Solaris17/watchguard/packaging/watchguard.8

.TH WATCHGUARD 8 "2026-07-03" "watchguard 1.0.0" "System Administration"
.SH NAME
watchguard \- plugin-based host health monitor for systemd Linux servers

.SH SYNOPSIS
.B watchguard
.I COMMAND
.RI [ OPTIONS ]

.SH DESCRIPTION
.B watchguard
is a lightweight Rust-based host health monitor for systemd Linux servers.

It can monitor SSH service health, SSH TCP reachability, outbound network reachability, DNS resolution, and OOM events observed through journald.

Watchguard uses a Rust plugin trait internally. Plugins are registered in
.B src/registry.rs
and implement the
.B Plugin
trait from
.BR src/plugin.rs .

.SH COMMANDS
.TP
.B watchguard daemon [--config PATH]
Run Watchguard as a foreground daemon. This is normally started by systemd.

.TP
.B watchguard status [--config PATH]
Show registered plugins and current probe status.

.TP
.B watchguard doctor [--config PATH]
Run diagnostic checks for config syntax, required commands, systemd, journald, and plugin prerequisites.

.TP
.B watchguard test [--config PATH] [--all]
Run plugin probes once and exit. By default, only enabled plugins are tested. With
.BR --all ,
all configured plugins are tested even if disabled.

.TP
.B watchguard logs [--unit UNIT] [--since TIME] [-n LINES] [-b|--boot] [--no-follow]
Show Watchguard logs through journalctl.

.TP
.B watchguard version
Print Watchguard version and build metadata.

.TP
.B watchguard enable PLUGIN [--config PATH]
Enable a plugin or sub-check.

.TP
.B watchguard disable PLUGIN [--remove] [--config PATH]
Disable a plugin or sub-check.

.SH PLUGINS
.TP
.B oom
Watches journald for OOM messages.

.TP
.B ssh-service
Checks the configured systemd SSH service unit.

.TP
.B ssh-targets
Checks SSH TCP target reachability.

.TP
.B network
Checks outbound TCP reachability to configured targets.

.TP
.B dns
Checks DNS resolution through a configured DNS server.

.SH PLUGIN DEVELOPMENT
A plugin implements the following core methods:

.EX
fn id(&self) -> &'static str;
fn name(&self) -> &'static str;
fn description(&self) -> &'static str;
fn enabled(&self) -> bool;
fn update_config(&mut self, cfg: &AppConfig);
fn probe(&mut self, rt: &Runtime) -> Result<bool>;
fn status(&mut self, rt: &Runtime) -> PluginStatus;
fn test(&mut self, rt: &Runtime) -> PluginStatus;
fn tick(&mut self, rt: &Runtime, now: Instant) -> TickOutcome;
.EE

To add a plugin, create a module under
.BR src/plugins/ ,
implement the trait, and register it in
.BR src/registry.rs .

.SH CONFIGURATION
The default configuration file is:

.EX
/etc/watchguard/config.toml
.EE

Durations use human-readable strings:

.EX
500ms
2s
30s
1m
5m
30m
1h
.EE

.SH LOGS
Follow logs:

.EX
watchguard logs
.EE

Show current boot logs without following:

.EX
watchguard logs --boot --no-follow
.EE

.SH EXAMPLES
Run diagnostics:

.EX
watchguard doctor
.EE

Test enabled plugins:

.EX
watchguard test
.EE

Test all configured plugins:

.EX
watchguard test --all
.EE

Enable SSH monitoring:

.EX
sudo watchguard enable ssh
sudo systemctl restart watchguard.service
.EE

Enable OOM monitoring:

.EX
sudo watchguard enable oom
sudo systemctl restart watchguard.service
.EE

.SH FILES
.TP
.I /usr/bin/watchguard
Watchguard binary.

.TP
.I /etc/watchguard/config.toml
Default configuration file.

.TP
.I /usr/lib/systemd/system/watchguard.service
Packaged systemd unit file.

.TP
.I /usr/share/man/man8/watchguard.8
Manual page.

.SH TROUBLESHOOTING
.TP
.B watchguard test --all fails disabled checks
This is expected. The
.B --all
flag tests configured plugins even when disabled. Use
.B watchguard test
to test only enabled plugins.

.TP
.B SSH service GetUnit error
The configured systemd unit does not exist. Check whether the host uses
.B sshd.service
or
.BR ssh.service .

.SH AUTHOR
Watchguard project
