Solaris17/watchguard/packaging/watchguard.8
.TH WATCHGUARD 8 "2026-07-03" "watchguard 1.0.0" "System Administration"
.SH NAME
watchguard \- plugin-based host health monitor for systemd Linux servers

.SH SYNOPSIS
.B watchguard
.I COMMAND
.RI [ OPTIONS ]

.SH DESCRIPTION
.B watchguard
is a lightweight Rust-based host health monitor for systemd Linux servers.

It can monitor SSH service health, SSH TCP reachability, outbound network reachability, DNS resolution, and OOM events observed through journald.

Watchguard can restart services, run commands, or reboot the host depending on configuration. Reboot actions are protected by boot grace and reboot cooldown settings.

.SH ACTIONS
Watchguard uses one remediation model: escalation steps.

Supported actions are:

.TP
.B none
Log only; take no remediation.

.TP
.B restart_service
Restart a configured systemd service. Requires a
.B service
field in the escalation step.

.TP
.B run_command
Run a configured command vector. Requires a
.B command
field in the escalation step.

.TP
.B reboot
Run the configured
.B commands.reboot
command, subject to boot grace and reboot cooldown.

.SH ESCALATION
Every enabled check uses an escalation list.

Escalation example:

.EX
failure_actions = [
  { after_failures = 3, action = "restart_service", service = "example.service" },
  { after_failures = 6, action = "run_command", command = ["/usr/local/bin/fix-example"] },
  { after_failures = 9, action = "reboot" }
]
.EE

This means:

.EX
3 consecutive failures -> restart service
6 consecutive failures -> run command
9 consecutive failures -> reboot
success -> counter resets
.EE

After the final escalation step has fired, Watchguard repeats the final step periodically using the final step threshold while the failure remains unresolved.

.SH COMMANDS
.TP
.B watchguard daemon [--config PATH]
Run Watchguard as a foreground daemon. This is normally started by systemd.

.TP
.B watchguard status [--config PATH]
Show registered plugins and current probe status.

.TP
.B watchguard doctor [--config PATH]
Run diagnostic checks for config syntax, required commands, systemd, journald, and plugin prerequisites.

.TP
.B watchguard test [--config PATH] [--all]
Run plugin probes once and exit. By default, only enabled plugins are tested. With
.BR --all ,
all configured plugins are tested even if disabled.

.TP
.B watchguard plugins [--config PATH]
List registered plugins, metadata, enabled state, and escalation plans.

.TP
.B watchguard logs [--unit UNIT] [--since TIME] [-n LINES] [-b|--boot] [--no-follow]
Show Watchguard logs through journalctl.

.TP
.B watchguard version
Print Watchguard version and build metadata.

.TP
.B watchguard enable PLUGIN [--config PATH]
Enable a plugin or sub-check.

.TP
.B watchguard disable PLUGIN [--remove] [--config PATH]
Disable a plugin or sub-check.

.SH PLUGINS
.TP
.B oom
Watches journald for OOM messages.

.TP
.B ssh-service
Checks the configured systemd SSH service unit.

.TP
.B ssh-targets
Checks SSH TCP target reachability.

.TP
.B network
Checks outbound TCP reachability to configured targets.

.TP
.B dns
Checks DNS resolution through a configured DNS server.

.SH SSH ESCALATION DEFAULTS
Packaged SSH defaults:

.EX
service_failure_actions = [
  { after_failures = 3, action = "restart_service", service = "sshd.service" },
  { after_failures = 6, action = "restart_service", service = "sshd.service" },
  { after_failures = 9, action = "reboot" }
]

ssh_failure_actions = [
  { after_failures = 3, action = "restart_service", service = "sshd.service" },
  { after_failures = 6, action = "restart_service", service = "sshd.service" },
  { after_failures = 9, action = "reboot" }
]
.EE

All plugins are disabled by default, so these actions only apply after SSH monitoring is enabled.

.SH NETWORK AND DNS SAFE DEFAULTS
Network and DNS remain conservative by default:

.EX
failure_actions = [
  { after_failures = 6, action = "none" }
]
.EE

Example network escalation:

.EX
failure_actions = [
  { after_failures = 6, action = "restart_service", service = "NetworkManager.service" },
  { after_failures = 12, action = "reboot" }
]
.EE

Example DNS escalation:

.EX
failure_actions = [
  { after_failures = 3, action = "run_command", command = ["/usr/bin/systemctl", "restart", "systemd-resolved.service"] },
  { after_failures = 9, action = "reboot" }
]
.EE

Only use reboot escalation after validating targets.

.SH CONFIGURATION
The default configuration file is:

.EX
/etc/watchguard/config.toml
.EE

Durations use human-readable strings:

.EX
500ms
2s
30s
1m
5m
30m
1h
.EE

.SH LOGS
Follow logs:

.EX
watchguard logs
.EE

Show current boot logs without following:

.EX
watchguard logs --boot --no-follow
.EE

.SH EXAMPLES
Run diagnostics:

.EX
watchguard doctor
.EE

Show plugins and escalation plans:

.EX
watchguard plugins
.EE

Test enabled plugins:

.EX
watchguard test
.EE

Test all configured plugins:

.EX
watchguard test --all
.EE

Enable SSH monitoring:

.EX
sudo watchguard enable ssh
sudo systemctl restart watchguard.service
.EE

.SH FILES
.TP
.I /usr/bin/watchguard
Watchguard binary.

.TP
.I /etc/watchguard/config.toml
Default configuration file.

.TP
.I /usr/lib/systemd/system/watchguard.service
Packaged systemd unit file.

.TP
.I /usr/share/man/man8/watchguard.8
Manual page.

.SH TROUBLESHOOTING
.TP
.B watchguard test --all fails disabled checks
This is expected. The
.B --all
flag tests configured plugins even when disabled. Use
.B watchguard test
to test only enabled plugins.

.TP
.B SSH service GetUnit error
The configured systemd unit does not exist. Check whether the host uses
.B sshd.service
or
.BR ssh.service .

.SH AUTHOR
Watchguard project
